tap "ngs/tap"
tap "nikitabobko/tap"
tap "vicentereig/tap"
brew "awscli"
brew "bat"
brew "btop"
brew "cloudflared"
brew "dust"
brew "duti"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "git-lfs"
brew "gitleaks"
brew "go"
brew "gum"
brew "imagemagick"
brew "kubernetes-cli"
brew "libpq"
brew "mas"
brew "mise"
brew "node"
brew "openslide"
brew "pandoc"
brew "rbenv"
brew "ruby"
brew "sox"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "television"
brew "terraform"
brew "terragrunt", link: false
brew "tgenv"
brew "tmux"
brew "trash"
brew "typst"
brew "vips"
brew "xcodegen"
brew "zoxide"
brew "ngs/tap/google-mcp-server"
brew "vicentereig/tap/whatsapp-cli"
cask "nikitabobko/tap/aerospace"
cask "blackhole-2ch"
cask "font-comfortaa"
cask "font-ioskeley-mono"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "karabiner-elements"
cask "maccy"
cask "windscribe"
cask "zerotier-one"
mas "Hyper Cursor", id: 1634220679
mas "Kindle", id: 302584613
mas "Xcode", id: 497799835
cargo "worker-build"
