akamud.vscode-theme-onedark
andrepimenta.claude-code-chat
anthropic.claude-code
aykutsarac.jsoncrack-vscode
d8aware.vscode-mermaid-extension
evgeniypetukhov.dark-low-contrast
foam.foam-vscode
github.vscode-github-actions
harryhopkinson.vim-theme
jnahian.jnahian-claude-theme
kilo9alfa.tam-terminal-activity-management
mermaidchart.vscode-mermaid-chart
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
nichabosh.minimalist-dark
nickc01.obsidian-theme
rust-lang.rust-analyzer
vstirbu.vscode-mermaid-preview
