[
  "chatgpt-md",
  "table-editor-obsidian",
  "obsidian-excalidraw-plugin",
  "url-into-selection",
  "obsidian-tasks-plugin",
  "folder-notes",
  "obsidian-style-settings",
  "obsidian-collapse-all-plugin",
  "meld-encrypt",
  "obsidian-minimal-settings",
  "obsidian-importer",
  "better-word-count",
  "editing-toolbar",
  "extract-url",
  "quickadd",
  "obsidian-epub-plugin",
  "cmdr",
  "obsidian-icon-folder",
  "digitalgarden",
  "recent-files-obsidian",
  "obsidian-linter",
  "rss-copyist",
  "obsidian-kindle-plugin",
  "obsidian-enhancing-export",
  "dataview",
  "completed-task-display",
  "file-explorer-note-count",
  "tag-wrangler",
  "obsidian-pandoc",
  "copy-as-html",
  "remove-html-tag",
  "obsidian-shellcommands",
  "chatmd-custom",
  "obsidian-paste-image-rename",
  "vscode-editor",
  "obsidian-folder-focus-mode",
  "hidden-folders-access",
  "codeblock-customizer",
  "custom-sort",
  "obsidian-kanban",
  "obsidian-dynamic-highlights",
  "creases"
]